cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "civo/tools"
tap "fluxcd/tap"
tap "kubeshark/kubeshark"

cask "firefox"
cask "obs"
cask "vlc"
cask "handbrake"
cask "gimp"
cask "vagrant" # requires rosetta 2 on M1, and VirtualBox dev preview, see README.md
cask "wireshark"
cask "vnc-viewer"
cask "google-cloud-sdk"
cask "dbeaver-community"
cask "altair-graphql-client"
cask "spotify"
cask "jitsi-meet"
cask "discord"
cask "grammarly-desktop"

cask "powershell"
cask "dotnet-sdk"

# Use manual self-service install
#cask "openjdk"
# Use manual install since apps provide their own updater incompatible with Homebrew
#cask "raycast"
#cask "visual-studio-code"

# System

## Essentials
brew "curl"
brew "wget"
brew "git"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "openssl"
brew "rsync"
brew "ssh-copy-id"
brew "screen"
brew "watch"

### Editors

brew "vim"

## Shell
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "grep"
brew "rename"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "gmp"
brew "rlwrap"
brew "viddy"
brew "ripgrep"
brew "xq"
brew "fd" # find alternative
brew "broot"

# Ops

## Network & DNS
brew "nmap"
brew "socat"
brew "dnstracer"
brew "dnsx"
brew "sslscan"

## Cloud CLI
brew "awscli"
brew "eksctl"
brew "azure-cli"
brew "hcloud"
brew "civo"

## Containers
brew "docker-compose"
brew "lima"
brew "colima"
brew "podman"
brew "kind"
brew "minikube"
brew "crane"
brew "krew"
brew "kubeshark"
brew "dive"
brew "k8sgpt"

## IaC
brew "ansible"
brew "ansible-lint"
brew "grype"
brew "jsonnet"
brew "jsonnet-bundler"
brew "opentofu"
brew "tfenv"
brew "tetra"

# Images, Audio, Video
brew "imagemagick"
brew "gifsicle"
brew "gifify"
brew "ffmpeg"

# Dev

## Archive & Git
brew "xz"
brew "p7zip"
brew "git"
brew "git-lfs"
brew "tig"
brew "hub"
brew "gh"
brew "glab"
# Extract rpm file content with rpm2cpio *.rpm | cpio -ivd
brew "rpm2cpio"

## JSON
brew "jq"
brew "jo"
brew "jless"

## Languages
# Note: Ruby/NodeJS are often managed locally with asdf.
brew "asdf"
brew "mise"

brew "yarn"
brew "ruby"
#brew "rbenv"
brew "python"
brew "pyenv"
brew "go"
brew "llvm"
brew "rust"
brew "gradle"
brew "scala"
brew "sbt"
brew "dotnet"
brew "lua"
brew "sqlite"

brew "cppcheck"
brew "cmake"
brew "boost"
brew "ninja"

# Use cases

## Embedded

brew "arduino-cli"
brew "arm-none-eabi-binutils"
brew "arm-none-eabi-gcc"
brew "tree-sitter"

## git-sim
brew "py3cairo"
brew "pango"
brew "scipy"

## GitLab Pages
brew "hugo"
brew "lychee"
brew "mkdocs"


